----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 51, 56, 56]           7,497
       BatchNorm2d-2           [-1, 51, 56, 56]             102
              ReLU-3           [-1, 51, 56, 56]               0
         MaxPool2d-4           [-1, 51, 28, 28]               0
            Conv2d-5           [-1, 51, 28, 28]           2,601
       BatchNorm2d-6           [-1, 51, 28, 28]             102
              ReLU-7           [-1, 51, 28, 28]               0
            Conv2d-8           [-1, 51, 28, 28]          23,409
       BatchNorm2d-9           [-1, 51, 28, 28]             102
             ReLU-10           [-1, 51, 28, 28]               0
           Conv2d-11          [-1, 204, 28, 28]          10,404
      BatchNorm2d-12          [-1, 204, 28, 28]             408
           Conv2d-13          [-1, 204, 28, 28]          10,404
      BatchNorm2d-14          [-1, 204, 28, 28]             408
             ReLU-15          [-1, 204, 28, 28]               0
       Bottleneck-16          [-1, 204, 28, 28]               0
           Conv2d-17           [-1, 51, 28, 28]          10,404
      BatchNorm2d-18           [-1, 51, 28, 28]             102
             ReLU-19           [-1, 51, 28, 28]               0
           Conv2d-20           [-1, 51, 28, 28]          23,409
      BatchNorm2d-21           [-1, 51, 28, 28]             102
             ReLU-22           [-1, 51, 28, 28]               0
           Conv2d-23          [-1, 204, 28, 28]          10,404
      BatchNorm2d-24          [-1, 204, 28, 28]             408
             ReLU-25          [-1, 204, 28, 28]               0
       Bottleneck-26          [-1, 204, 28, 28]               0
           Conv2d-27           [-1, 51, 28, 28]          10,404
      BatchNorm2d-28           [-1, 51, 28, 28]             102
             ReLU-29           [-1, 51, 28, 28]               0
           Conv2d-30           [-1, 51, 28, 28]          23,409
      BatchNorm2d-31           [-1, 51, 28, 28]             102
             ReLU-32           [-1, 51, 28, 28]               0
           Conv2d-33          [-1, 204, 28, 28]          10,404
      BatchNorm2d-34          [-1, 204, 28, 28]             408
             ReLU-35          [-1, 204, 28, 28]               0
       Bottleneck-36          [-1, 204, 28, 28]               0
           Conv2d-37          [-1, 102, 28, 28]          20,808
      BatchNorm2d-38          [-1, 102, 28, 28]             204
             ReLU-39          [-1, 102, 28, 28]               0
           Conv2d-40          [-1, 102, 14, 14]          93,636
      BatchNorm2d-41          [-1, 102, 14, 14]             204
             ReLU-42          [-1, 102, 14, 14]               0
           Conv2d-43          [-1, 408, 14, 14]          41,616
      BatchNorm2d-44          [-1, 408, 14, 14]             816
           Conv2d-45          [-1, 408, 14, 14]          83,232
      BatchNorm2d-46          [-1, 408, 14, 14]             816
             ReLU-47          [-1, 408, 14, 14]               0
       Bottleneck-48          [-1, 408, 14, 14]               0
           Conv2d-49          [-1, 102, 14, 14]          41,616
      BatchNorm2d-50          [-1, 102, 14, 14]             204
             ReLU-51          [-1, 102, 14, 14]               0
           Conv2d-52          [-1, 102, 14, 14]          93,636
      BatchNorm2d-53          [-1, 102, 14, 14]             204
             ReLU-54          [-1, 102, 14, 14]               0
           Conv2d-55          [-1, 408, 14, 14]          41,616
      BatchNorm2d-56          [-1, 408, 14, 14]             816
             ReLU-57          [-1, 408, 14, 14]               0
       Bottleneck-58          [-1, 408, 14, 14]               0
           Conv2d-59          [-1, 102, 14, 14]          41,616
      BatchNorm2d-60          [-1, 102, 14, 14]             204
             ReLU-61          [-1, 102, 14, 14]               0
           Conv2d-62          [-1, 102, 14, 14]          93,636
      BatchNorm2d-63          [-1, 102, 14, 14]             204
             ReLU-64          [-1, 102, 14, 14]               0
           Conv2d-65          [-1, 408, 14, 14]          41,616
      BatchNorm2d-66          [-1, 408, 14, 14]             816
             ReLU-67          [-1, 408, 14, 14]               0
       Bottleneck-68          [-1, 408, 14, 14]               0
           Conv2d-69          [-1, 102, 14, 14]          41,616
      BatchNorm2d-70          [-1, 102, 14, 14]             204
             ReLU-71          [-1, 102, 14, 14]               0
           Conv2d-72          [-1, 102, 14, 14]          93,636
      BatchNorm2d-73          [-1, 102, 14, 14]             204
             ReLU-74          [-1, 102, 14, 14]               0
           Conv2d-75          [-1, 408, 14, 14]          41,616
      BatchNorm2d-76          [-1, 408, 14, 14]             816
             ReLU-77          [-1, 408, 14, 14]               0
       Bottleneck-78          [-1, 408, 14, 14]               0
           Conv2d-79          [-1, 204, 14, 14]          83,232
      BatchNorm2d-80          [-1, 204, 14, 14]             408
             ReLU-81          [-1, 204, 14, 14]               0
           Conv2d-82            [-1, 204, 7, 7]         374,544
      BatchNorm2d-83            [-1, 204, 7, 7]             408
             ReLU-84            [-1, 204, 7, 7]               0
           Conv2d-85            [-1, 816, 7, 7]         166,464
      BatchNorm2d-86            [-1, 816, 7, 7]           1,632
           Conv2d-87            [-1, 816, 7, 7]         332,928
      BatchNorm2d-88            [-1, 816, 7, 7]           1,632
             ReLU-89            [-1, 816, 7, 7]               0
       Bottleneck-90            [-1, 816, 7, 7]               0
           Conv2d-91            [-1, 204, 7, 7]         166,464
      BatchNorm2d-92            [-1, 204, 7, 7]             408
             ReLU-93            [-1, 204, 7, 7]               0
           Conv2d-94            [-1, 204, 7, 7]         374,544
      BatchNorm2d-95            [-1, 204, 7, 7]             408
             ReLU-96            [-1, 204, 7, 7]               0
           Conv2d-97            [-1, 816, 7, 7]         166,464
      BatchNorm2d-98            [-1, 816, 7, 7]           1,632
             ReLU-99            [-1, 816, 7, 7]               0
      Bottleneck-100            [-1, 816, 7, 7]               0
          Conv2d-101            [-1, 204, 7, 7]         166,464
     BatchNorm2d-102            [-1, 204, 7, 7]             408
            ReLU-103            [-1, 204, 7, 7]               0
          Conv2d-104            [-1, 204, 7, 7]         374,544
     BatchNorm2d-105            [-1, 204, 7, 7]             408
            ReLU-106            [-1, 204, 7, 7]               0
          Conv2d-107            [-1, 816, 7, 7]         166,464
     BatchNorm2d-108            [-1, 816, 7, 7]           1,632
            ReLU-109            [-1, 816, 7, 7]               0
      Bottleneck-110            [-1, 816, 7, 7]               0
          Conv2d-111            [-1, 204, 7, 7]         166,464
     BatchNorm2d-112            [-1, 204, 7, 7]             408
            ReLU-113            [-1, 204, 7, 7]               0
          Conv2d-114            [-1, 204, 7, 7]         374,544
     BatchNorm2d-115            [-1, 204, 7, 7]             408
            ReLU-116            [-1, 204, 7, 7]               0
          Conv2d-117            [-1, 816, 7, 7]         166,464
     BatchNorm2d-118            [-1, 816, 7, 7]           1,632
            ReLU-119            [-1, 816, 7, 7]               0
      Bottleneck-120            [-1, 816, 7, 7]               0
          Conv2d-121            [-1, 204, 7, 7]         166,464
     BatchNorm2d-122            [-1, 204, 7, 7]             408
            ReLU-123            [-1, 204, 7, 7]               0
          Conv2d-124            [-1, 204, 7, 7]         374,544
     BatchNorm2d-125            [-1, 204, 7, 7]             408
            ReLU-126            [-1, 204, 7, 7]               0
          Conv2d-127            [-1, 816, 7, 7]         166,464
     BatchNorm2d-128            [-1, 816, 7, 7]           1,632
            ReLU-129            [-1, 816, 7, 7]               0
      Bottleneck-130            [-1, 816, 7, 7]               0
          Conv2d-131            [-1, 204, 7, 7]         166,464
     BatchNorm2d-132            [-1, 204, 7, 7]             408
            ReLU-133            [-1, 204, 7, 7]               0
          Conv2d-134            [-1, 204, 7, 7]         374,544
     BatchNorm2d-135            [-1, 204, 7, 7]             408
            ReLU-136            [-1, 204, 7, 7]               0
          Conv2d-137            [-1, 816, 7, 7]         166,464
     BatchNorm2d-138            [-1, 816, 7, 7]           1,632
            ReLU-139            [-1, 816, 7, 7]               0
      Bottleneck-140            [-1, 816, 7, 7]               0
          Conv2d-141            [-1, 408, 7, 7]         332,928
     BatchNorm2d-142            [-1, 408, 7, 7]             816
            ReLU-143            [-1, 408, 7, 7]               0
          Conv2d-144            [-1, 408, 4, 4]       1,498,176
     BatchNorm2d-145            [-1, 408, 4, 4]             816
            ReLU-146            [-1, 408, 4, 4]               0
          Conv2d-147           [-1, 1632, 4, 4]         665,856
     BatchNorm2d-148           [-1, 1632, 4, 4]           3,264
          Conv2d-149           [-1, 1632, 4, 4]       1,331,712
     BatchNorm2d-150           [-1, 1632, 4, 4]           3,264
            ReLU-151           [-1, 1632, 4, 4]               0
      Bottleneck-152           [-1, 1632, 4, 4]               0
          Conv2d-153            [-1, 408, 4, 4]         665,856
     BatchNorm2d-154            [-1, 408, 4, 4]             816
            ReLU-155            [-1, 408, 4, 4]               0
          Conv2d-156            [-1, 408, 4, 4]       1,498,176
     BatchNorm2d-157            [-1, 408, 4, 4]             816
            ReLU-158            [-1, 408, 4, 4]               0
          Conv2d-159           [-1, 1632, 4, 4]         665,856
     BatchNorm2d-160           [-1, 1632, 4, 4]           3,264
            ReLU-161           [-1, 1632, 4, 4]               0
      Bottleneck-162           [-1, 1632, 4, 4]               0
          Conv2d-163            [-1, 408, 4, 4]         665,856
     BatchNorm2d-164            [-1, 408, 4, 4]             816
            ReLU-165            [-1, 408, 4, 4]               0
          Conv2d-166            [-1, 408, 4, 4]       1,498,176
     BatchNorm2d-167            [-1, 408, 4, 4]             816
            ReLU-168            [-1, 408, 4, 4]               0
          Conv2d-169           [-1, 1632, 4, 4]         665,856
     BatchNorm2d-170           [-1, 1632, 4, 4]           3,264
            ReLU-171           [-1, 1632, 4, 4]               0
      Bottleneck-172           [-1, 1632, 4, 4]               0
AdaptiveAvgPool2d-173           [-1, 1632, 1, 1]               0
          Linear-174                 [-1, 8631]      14,094,423
================================================================
Total params: 29,032,374
Trainable params: 29,032,374
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.14
Forward/backward pass size (MB): 57.99
Params size (MB): 110.75
Estimated Total Size (MB): 168.88
----------------------------------------------------------------
